"""Константы проекта"""

# Базовый URL
BASE_URL = "https://qa-scooter.praktikum-services.ru"

# URL страниц
MAIN_PAGE_URL = f"{BASE_URL}/"
ORDER_PAGE_URL = f"{BASE_URL}/order"

# Тексты ответов на вопросы
ANSWER_1_TEXT = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
ANSWER_2_TEXT = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
ANSWER_3_TEXT = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
ANSWER_4_TEXT = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
ANSWER_5_TEXT = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
ANSWER_6_TEXT = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
ANSWER_7_TEXT = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
ANSWER_8_TEXT = "Да, обязательно. Всем самокатов! И Москве, и Московской области."